ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C29/f29h85x_mcan_regs.xml
	<register id="MCAN_ILE" width="32" page="0" offset="0x5c" instances="1" instaddr="4" internal="0" description="MCAN Interrupt Line Enable">
		<bitfield id="EINT0" description="Enable Interrupt Line 0" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EINT1" description="Enable Interrupt Line 1" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="MCAN_GFC" width="32" page="0" offset="0x80" instances="1" instaddr="4" internal="0" description="MCAN Global Filter Configuration">
		<bitfield id="RRFE" description="Reject Remote Frames Extended" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="RRFS" description="Reject Remote Frames Standard" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ANFE" description="Accept Non-matching Frames Extended" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="ANFS" description="Accept Non-matching Frames Standard" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="MCAN_SIDFC" width="32" page="0" offset="0x84" instances="1" instaddr="4" internal="0" description="MCAN Standard ID Filter Configuration">
		<bitfield id="FLSSA" description="Filter List Standard Start Address" begin="15" end="2" width="14" rwaccess="RW"/>
		<bitfield id="LSS" description="List Size Standard" begin="23" end="16" width="8" rwaccess="RW"/>
	</register>
	<register id="MCAN_XIDFC" width="32" page="0" offset="0x88" instances="1" instaddr="4" internal="0" description="MCAN Extended ID Filter Configuration">
		<bitfield id="FLESA" description="Filter List Extended Start Address" begin="15" end="2" width="14" rwaccess="RW"/>
		<bitfield id="LSE" description="List Size Extended" begin="22" end="16" width="7" rwaccess="RW"/>
	</register>
	<register id="MCAN_XIDAM" width="32" page="0" offset="0x90" instances="1" instaddr="4" internal="0" description="MCAN Extended ID and Mask">
		<bitfield id="EIDM" description="Extended ID Mask" begin="28" end="0" width="29" rwaccess="RW"/>
	</register>
	<register id="MCAN_HPMS" width="32" page="0" offset="0x94" instances="1" instaddr="4" internal="0" description="MCAN High Priority Message Status">
		<bitfield id="BIDX" description="Buffer Index" begin="5" end="0" width="6" rwaccess="R"/>
		<bitfield id="MSI" description="Message Storage Indicator" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="FIDX" description="Filter Index" begin="14" end="8" width="7" rwaccess="R"/>
		<bitfield id="FLST" description="Filter List" begin="15" end="15" width="1" rwaccess="R"/>
	</register>
	<register id="MCAN_NDAT1" width="32" page="0" offset="0x98" instances="1" instaddr="4" internal="0" description="MCAN New Data 1">
		<bitfield id="ND0" description="New Data RX Buffer 0" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ND1" description="New Data RX Buffer 1" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ND2" description="New Data RX Buffer 2" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ND3" description="New Data RX Buffer 3" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="ND4" description="New Data RX Buffer 4" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ND5" description="New Data RX Buffer 5" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ND6" description="New Data RX Buffer 6" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="ND7" description="New Data RX Buffer 7" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="ND8" description="New Data RX Buffer 8" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="ND9" description="New Data RX Buffer 9" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="ND10" description="New Data RX Buffer 10" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="ND11" description="New Data RX Buffer 11" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="ND12" description="New Data RX Buffer 12" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="ND13" description="New Data RX Buffer 13" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="ND14" description="New Data RX Buffer 14" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="ND15" description="New Data RX Buffer 15" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="ND16" description="New Data RX Buffer 16" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="ND17" description="New Data RX Buffer 17" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="ND18" description="New Data RX Buffer 18" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="ND19" description="New Data RX Buffer 19" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="ND20" description="New Data RX Buffer 20" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="ND21" description="New Data RX Buffer 21" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="ND22" description="New Data RX Buffer 22" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="ND23" description="New Data RX Buffer 23" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="ND24" description="New Data RX Buffer 24" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="ND25" description="New Data RX Buffer 25" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="ND26" description="New Data RX Buffer 26" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="ND27" description="New Data RX Buffer 27" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="ND28" description="New Data RX Buffer 28" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="ND29" description="New Data RX Buffer 29" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="ND30" description="New Data RX Buffer 30" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="ND31" description="New Data RX Buffer 31" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="MCAN_NDAT2" width="32" page="0" offset="0x9c" instances="1" instaddr="4" internal="0" description="MCAN New Data 2">
		<bitfield id="ND32" description="New Data RX Buffer 32" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ND33" description="New Data RX Buffer 33" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ND34" description="New Data RX Buffer 34" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ND35" description="New Data RX Buffer 35" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="ND36" description="New Data RX Buffer 36" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ND37" description="New Data RX Buffer 37" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ND38" description="New Data RX Buffer 38" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="ND39" description="New Data RX Buffer 39" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="ND40" description="New Data RX Buffer 40" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="ND41" description="New Data RX Buffer 41" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="ND42" description="New Data RX Buffer 42" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="ND43" description="New Data RX Buffer 43" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="ND44" description="New Data RX Buffer 44" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="ND45" description="New Data RX Buffer 45" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="ND46" description="New Data RX Buffer 46" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="ND47" description="New Data RX Buffer 47" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="ND48" description="New Data RX Buffer 48" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="ND49" description="New Data RX Buffer 49" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="ND50" description="New Data RX Buffer 50" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="ND51" description="New Data RX Buffer 51" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="ND52" description="New Data RX Buffer 52" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="ND53" description="New Data RX Buffer 53" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="ND54" description="New Data RX Buffer 54" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="ND55" description="New Data RX Buffer 55" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="ND56" description="New Data RX Buffer 56" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="ND57" description="New Data RX Buffer 57" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="ND58" description="New Data RX Buffer 58" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="ND59" description="New Data RX Buffer 59" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="ND60" description="New Data RX Buffer 60" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="ND61" description="New Data RX Buffer 61" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="ND62" description="New Data RX Buffer 62" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="ND63" description="New Data RX Buffer 63" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="MCAN_RXF0C" width="32" page="0" offset="0xa0" instances="1" instaddr="4" internal="0" description="MCAN Rx FIFO 0 Configuration">
		<bitfield id="F0SA" description="Rx FIFO 0 Start Address" begin="15" end="2" width="14" rwaccess="RW"/>
		<bitfield id="F0S" description="Rx FIFO 0 Size" begin="22" end="16" width="7" rwaccess="RW"/>
		<bitfield id="F0WM" description="Rx FIFO 0 Watermark" begin="30" end="24" width="7" rwaccess="RW"/>
		<bitfield id="F0OM" description="FIFO 0 Operation Mode" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="MCAN_RXF0S" width="32" page="0" offset="0xa4" instances="1" instaddr="4" internal="0" description="MCAN Rx FIFO 0 Status">
		<bitfield id="F0FL" description="Rx FIFO 0 Fill Level" begin="6" end="0" width="7" rwaccess="R"/>
		<bitfield id="F0GI" description="Rx FIFO 0 Get Index" begin="13" end="8" width="6" rwaccess="R"/>
		<bitfield id="F0PI" description="Rx FIFO 0 Put Index" begin="21" end="16" width="6" rwaccess="R"/>
		<bitfield id="F0F" description="Rx FIFO 0 Full" begin="24" end="24" width="1" rwaccess="R"/>
		<bitfield id="RF0L" description="Rx FIFO 0 Message Lost" begin="25" end="25" width="1" rwaccess="R"/>
	</register>
